app/views/carts/show.html.erb

SELECT "cart_products".* FROM "cart_products"
---
  <tbody>
    <% CartProduct.all.each do |product| %>