app/controllers/carts_controller.rb

  def add
  	#render plain: params
  	p = Product.find params[:product_id]
  	c = CartProduct.create
    c.cart_id = current_user.id
    c.price = p.price
    c.description = p.description
    c.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
SELECT "cart_products".* FROM "cart_products"
INSERT INTO "cart_products" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-11-03 17:41:06.621555"], ["updated_at", "2015-11-03 17:41:06.621555"]]
UPDATE "cart_products" SET "cart_id" = ?, "price" = ?, "description" = ?, "updated_at" = ? WHERE "cart_products"."id" = ?

  def remove
    #render plain: params
    CartProduct.destroy params[:product_id]
---
DELETE FROM "cart_products" WHERE "cart_products"."id" = ?  [["id", 1]]

  def find_all
    productArray = []
    CartProduct.all.each do |cartProduct|
---
SELECT "cart_products".* FROM "cart_products"