app/controllers/cart_products_controller.rb

SELECT  "cart_products".* FROM "cart_products" WHERE "cart_products"."id" = ? LIMIT 1  [["id", 6]]
---
  def show
    @cart_product = CartProduct.find params[:id]