app/controllers/products_controller.rb

  def index
    @products = Product.all
---
SELECT "products".* FROM "products" WHERE (description LIKE '%Saturday')  ORDER BY created_at DESC

  def show
    @product = Product.find params[:id]
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @product = Product.new(product_params)
    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("description", "price", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "test"], ["price", 0.0], ["image", ""], ["created_at", "2015-11-02 16:19:54.159254"], ["updated_at", "2015-11-02 16:19:54.159254"]]

    def find_reviews id
      reviews = Array.new
      Review.all.each do |r|
---
SELECT "reviews".* FROM "reviews"