app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)

    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("body", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "aKSJHaksjhakjSHkjas"], ["product_id", 1], ["created_at", "2015-11-03 22:26:16.593350"], ["updated_at", "2015-11-03 22:26:16.593350"]]

  def find_product product_id
  	Product.find product_id
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 8]]